{
    "termsAndConditions": {
      "sections": [
        {
          "title": "1. Introduction",
          "content": "Welcome to Eat Le Mou. By accessing or using our services, including dining at our restaurants, ordering online, or interacting with our website and social media platforms, you agree to comply with and be bound by the following Terms and Conditions. Please read them carefully. If you do not agree with any part of these terms, you should not use our services."
        },
        {
          "title": "2. General Terms",
          "subsections": [
            {
              "title": "2.1 Age Requirement",
              "content": "You must be at least 18 years old to make a reservation or place an order online."
            },
            {
              "title": "2.2 Conduct",
              "content": "You agree to use our services for lawful purposes only. Harassment, abuse, or disrespectful behavior towards our staff or other patrons will not be tolerated."
            }
          ]
        },
        {
          "title": "3. Reservations and Dining",
          "subsections": [
            {
              "title": "3.1 Reservations",
              "content": "Reservations can be made via our website, phone, or in person. We reserve the right to refuse any reservation at our discretion."
            },
            {
              "title": "3.2 Cancellations",
              "content": "Please notify us at least 24 hours in advance if you need to cancel or reschedule your reservation."
            },
            {
              "title": "3.3 Late Arrivals",
              "content": "If you are more than 15 minutes late for your reservation, we may release your table to other guests."
            }
          ]
        },
        {
          "title": "4. Online Orders",
          "subsections": [
            {
              "title": "4.1 Accuracy of Information",
              "content": "You are responsible for providing accurate information when placing an order. Eat Le Mou is not responsible for any issues arising from incorrect information provided by you."
            },
            {
              "title": "4.2 Order Confirmation",
              "content": "Once your order is placed, you will receive a confirmation email. Please review your order for accuracy. If there are any issues, contact us immediately."
            },
            {
              "title": "4.3 Cancellations and Modifications",
              "content": "Orders can be canceled or modified within 10 minutes of placing the order. After this period, we may not be able to accommodate changes."
            }
          ]
        },
        {
          "title": "5. Payment and Pricing",
          "subsections": [
            {
              "title": "5.1 Pricing",
              "content": "All prices are listed in the local currency and are subject to change without notice. Prices include applicable taxes unless otherwise stated."
            },
            {
              "title": "5.2 Payment Methods",
              "content": "We accept various payment methods, including cash, credit/debit cards, and mobile payments. Online orders must be paid for at the time of ordering."
            },
            {
              "title": "5.3 Refunds",
              "content": "Refunds are issued at the discretion of Eat Le Mou. If you are not satisfied with your order, please contact us within 24 hours."
            }
          ]
        },
        {
          "title": "6. Allergies and Dietary Requirements",
          "content": "If you have any food allergies or dietary requirements, please inform our staff when placing your order. While we take precautions to prevent cross-contamination, we cannot guarantee a completely allergen-free environment."
        },
        {
          "title": "7. Voucher, Points and Promotions",
          "subsections": [
            {
              "title": "7.1 Voucher and Points",
              "content": "Available for purchase and are valid for one year from the date of issuance and cannot be exchanged for cash and are non-refundable."
            },
            {
              "title": "7.2 Promotions",
              "content": "Promotional offers are subject to specific terms and conditions. Eat Le Mou reserves the right to modify or cancel promotions at any time without prior notice."
            }
          ]
        },
        {
          "title": "8. Intellectual Property",
          "subsections": [
            {
              "title": "8.1 Ownership",
              "content": "All content on our website and social media platforms, including text, graphics, logos, and images, is the property of Eat Le Mou or its content suppliers and is protected by copyright laws."
            },
            {
              "title": "8.2 Use of Content",
              "content": "You may not reproduce, distribute, or use any content from our website without prior written permission from Eat Le Mou."
            }
          ]
        },
        {
          "title": "9. Privacy Policy",
          "content": "We collect and use your personal information in accordance with our Privacy Policy. By using our services, you consent to the collection and use of your information as described in our Privacy Policy."
        },
        {
          "title": "10. Limitation of Liability",
          "subsections": [
            {
              "title": "10.1 No Warranty",
              "content": "Eat Le Mou provides services on an 'as is' and 'as available' basis. We make no warranties, express or implied, regarding the accuracy or reliability of our services."
            },
            {
              "title": "10.2 Limitation",
              "content": "To the maximum extent permitted by law, Eat Le Mou shall not be liable for any indirect, incidental, or consequential damages arising from your use of our services."
            }
          ]
        },
        {
          "title": "11. Changes to Terms and Conditions",
          "content": "Eat Le Mou reserves the right to modify these Terms and Conditions at any time. Changes will be effective immediately upon posting on our website. Your continued use of our services constitutes acceptance of the modified terms."
        },
        {
          "title": "12. Governing Law",
          "content": "These Terms and Conditions shall be governed by and construed in accordance with the laws of the country where Eat Le Mou operates. Any disputes arising from these terms shall be subject to the exclusive jurisdiction of the courts in that country."
        },
        {
          "title": "Acknowledgment",
          "content": "By using our services, you acknowledge that you have read, understood, and agree to be bound by these Terms and Conditions. Thank you for choosing Eat Le Mou. We look forward to serving you!"
        }
      ]
    },
    "privacyPolicy": {
      "sections": [
        {
          "title": "1. Introduction",
          "content": "At Eat Le Mou, we are committed to protecting your privacy and ensuring that your personal information is handled in a safe and responsible manner. This Privacy Policy outlines how we collect, use, and safeguard your information when you interact with us, whether through our website, mobile applications, or in our restaurants."
        },
        {
          "title": "2. Information We Collect",
          "subsections": [
            {
              "title": "2.1 Personal Information",
              "content": "We may collect personal information that you provide to us directly, such as your name, email address, phone number, postal address, payment information, and any other details you provide when making a reservation, placing an order, or contacting us."
            },
            {
              "title": "2.2 Usage Information",
              "content": "We may collect information about how you interact with our website, mobile applications, and services. This includes your IP address, browser type, operating system, pages viewed, and other similar data."
            },
            {
              "title": "2.3 Cookies and Tracking Technologies",
              "content": "We use cookies and similar tracking technologies to enhance your experience on our website and gather information about how our site is used. You can manage your cookie preferences through your browser settings."
            }
          ]
        },
        {
          "title": "3. How We Use Your Information",
          "subsections": [
            {
              "title": "3.1 To Provide Services",
              "content": "We use your information to process reservations, orders, and payments, and to provide you with the services you request."
            },
            {
              "title": "3.2 To Communicate with You",
              "content": "We may use your contact information to send you updates, promotional materials, and other information related to our services. You can opt out of receiving these communications at any time."
            },
            {
              "title": "3.3 To Improve Our Services",
              "content": "We use the information we collect to understand how our services are used and to improve the overall user experience. This includes analyzing trends, monitoring usage, and making enhancements to our offerings."
            },
            {
              "title": "3.4 For Security and Compliance",
              "content": "We may use your information to protect the security and integrity of our services, comply with legal obligations, and enforce our terms and conditions."
            }
          ]
        },
        {
          "title": "4. Sharing Your Information",
          "subsections": [
            {
              "title": "4.1 Third-Party Service Providers",
              "content": "We may share your information with third-party service providers who assist us in operating our business, such as payment processors, reservation platforms, and marketing agencies. These providers are required to protect your information and use it only for the purposes for which it was disclosed."
            },
            {
              "title": "4.2 Legal Requirements",
              "content": "We may disclose your information if required by law, regulation, or legal process, or in response to a government request."
            },
            {
              "title": "4.3 Business Transfers",
              "content": "In the event of a merger, acquisition, or sale of assets, your information may be transferred to the new entity."
            }
          ]
        },
        {
          "title": "5. Data Security",
          "content": "We implement appropriate security measures to protect your information from unauthorized access, disclosure, alteration, or destruction. However, no security system is completely infallible, and we cannot guarantee the absolute security of your information."
        },
        {
          "title": "6. Your Rights and Choices",
          "subsections": [
            {
              "title": "6.1 Access and Correction",
              "content": "You have the right to access and update your personal information. If you need assistance, please contact us using the information provided below."
            },
            {
              "title": "6.2 Opt-Out",
              "content": "You can opt out of receiving promotional communications from us by following the unsubscribe instructions in those communications or by contacting us directly."
            },
            {
              "title": "6.3 Cookie Preferences",
              "content": "You can manage your cookie preferences through your browser settings. Please note that disabling cookies may affect the functionality of our website."
            }
          ]
        },
        {
          "title": "7. Children's Privacy",
          "content": "Our services are not intended for individuals under the age of 18. We do not knowingly collect personal information from children. If we become aware that we have inadvertently collected information from a child, we will take steps to delete it as soon as possible."
        },
        {
          "title": "8. Changes to This Privacy Policy",
          "content": "We may update this Privacy Policy from time to time to reflect changes in our practices or legal requirements. We will post any updates on our website and indicate the date of the latest revision. Your continued use of our services after any changes indicates your acceptance of the updated Privacy Policy."
        }
      ]
    }
  }
  